test/cassettes/test_tokenise_creditcard_from_session_for_later_purchase.yml

--- 
recorded_with: VCR 2.9.3
http_interactions: 
- request: 
    method: post
    uri: https://merchant.<TNS_MERCHANT_ID>:<TNS_API_KEY>@secure.ap.tnspayments.com/api/rest/version/30/merchant/<TNS_MERCHANT_ID>/session
    body: 
      string: ""
    headers: 
      Accept: 
      - "*/*"
      Accept-Encoding: 
      - gzip, deflate
      Content-Type: 
      - Application/json;charset=UTF-8
  response: 
    status: 
      code: 201
      message: Created
    headers: 
      Expires: 
      - "0"
      Cache-Control: 
      - no-cache, no-store, must-revalidate
      Date: 
      - Tue, 26 Jan 2016 06:50:28 GMT
      Set-Cookie: 
      - TS018aacab=01c9ad79a06332335b857767dcf3d592e780db5539d71c6ff7fa017d893df25cf6abee0a2d; Path=/
      Pragma: 
      - no-cache
      Content-Length: 
      - "149"
      Content-Type: 
      - application/json;charset=UTF-8
    body: 
      string: "{\"merchant\":\"<TNS_MERCHANT_ID>\",\"result\":\"SUCCESS\",\"session\":{\"id\":\"SESSION0002989021721N49832683K1\",\"updateStatus\":\"NO_UPDATE\",\"version\":\"deae05b501\"}}"
    http_version: 
  recorded_at: Tue, 26 Jan 2016 06:50:28 GMT
- request: 
    method: put
    uri: https://merchant.<TNS_MERCHANT_ID>:<TNS_API_KEY>@secure.ap.tnspayments.com/api/rest/version/30/merchant/<TNS_MERCHANT_ID>/session/SESSION0002989021721N49832683K1
    body: 
      string: "{\"sourceOfFunds\":{\"type\":\"CARD\",\"provided\":{\"card\":{\"number\":\"4005550000000001\",\"expiry\":{\"month\":\"5\",\"year\":\"17\"},\"securityCode\":\"123\"}}}}"
    headers: 
      Accept: 
      - "*/*"
      Accept-Encoding: 
      - gzip, deflate
      Content-Length: 
      - "139"
      Content-Type: 
      - Application/json;charset=UTF-8
  response: 
    status: 
      code: 200
      message: OK
    headers: 
      Expires: 
      - "0"
      Cache-Control: 
      - no-cache, no-store, must-revalidate
      Date: 
      - Tue, 26 Jan 2016 06:50:28 GMT
      Set-Cookie: 
      - TS018aacab=01c9ad79a0213bfb92d5455f8afe59653187cb29bec8606418aa2b4640d28d473ab7e11082; Path=/
      Pragma: 
      - no-cache
      Content-Length: 
      - "337"
      Content-Type: 
      - application/json;charset=UTF-8
    body: 
      string: "{\"merchant\":\"<TNS_MERCHANT_ID>\",\"session\":{\"id\":\"SESSION0002989021721N49832683K1\",\"updateStatus\":\"SUCCESS\",\"version\":\"c093377a02\"},\"sourceOfFunds\":{\"provided\":{\"card\":{\"brand\":\"VISA\",\"expiry\":{\"month\":\"5\",\"year\":\"17\"},\"fundingMethod\":\"CREDIT\",\"number\":\"400555xxxxxx0001\",\"scheme\":\"VISA\",\"securityCode\":\"xxx\"}},\"type\":\"CARD\"},\"version\":\"30\"}"
    http_version: 
  recorded_at: Tue, 26 Jan 2016 06:50:28 GMT
- request: 
    method: post
    uri: https://merchant.<TNS_MERCHANT_ID>:<TNS_API_KEY>@secure.ap.tnspayments.com/api/rest/version/30/merchant/<TNS_MERCHANT_ID>/token
    body: 
      string: "{\"session\":{\"id\":\"SESSION0002989021721N49832683K1\"},\"sourceOfFunds\":{\"type\":\"CARD\"}}"
    headers: 
      Accept: 
      - "*/*"
      Accept-Encoding: 
      - gzip, deflate
      Content-Length: 
      - "84"
      Content-Type: 
      - Application/json;charset=UTF-8
  response: 
    status: 
      code: 201
      message: Created
    headers: 
      Expires: 
      - "0"
      Cache-Control: 
      - no-cache, no-store, must-revalidate
      Date: 
      - Tue, 26 Jan 2016 06:50:29 GMT
      Set-Cookie: 
      - TS018aacab=01c9ad79a03ca3f3e1e424b2dfc306a4aa139e4551b59f58a17c5d44964afe17f1d10383ab; Path=/
      Pragma: 
      - no-cache
      Content-Length: 
      - "458"
      Content-Type: 
      - application/json;charset=UTF-8
    body: 
      string: "{\"repositoryId\":\"TESTSUELDO\",\"response\":{\"gatewayCode\":\"BASIC_VERIFICATION_SUCCESSFUL\"},\"result\":\"SUCCESS\",\"sourceOfFunds\":{\"provided\":{\"card\":{\"brand\":\"VISA\",\"expiry\":\"0517\",\"fundingMethod\":\"CREDIT\",\"number\":\"400555xxxxxx0001\",\"scheme\":\"VISA\"}},\"type\":\"CARD\"},\"status\":\"VALID\",\"token\":\"9117717323490920\",\"usage\":{\"lastUpdated\":\"2016-01-26T06:50:29.219Z\",\"lastUpdatedBy\":\"<TNS_MERCHANT_ID>\",\"lastUsed\":\"2016-01-26T06:50:29.219Z\"},\"verificationStrategy\":\"BASIC\"}"
    http_version: 
  recorded_at: Tue, 26 Jan 2016 06:50:29 GMT
- request: 
    method: put
    uri: https://merchant.<TNS_MERCHANT_ID>:<TNS_API_KEY>@secure.ap.tnspayments.com/api/rest/version/30/merchant/<TNS_MERCHANT_ID>/order/10000001705/transaction/PAY
    body: 
      string: "{\"apiOperation\":\"PAY\",\"order\":{\"amount\":\"100.00\",\"currency\":\"EUR\",\"reference\":\"PAY\"},\"transaction\":{\"reference\":\"PAY\"},\"sourceOfFunds\":{\"type\":\"CARD\",\"token\":\"9117717323490920\"}}"
    headers: 
      Accept: 
      - "*/*"
      Accept-Encoding: 
      - gzip, deflate
      Content-Length: 
      - "178"
      Content-Type: 
      - Application/json;charset=UTF-8
  response: 
    status: 
      code: 201
      message: Created
    headers: 
      Expires: 
      - "0"
      Cache-Control: 
      - no-cache, no-store, must-revalidate
      Date: 
      - Tue, 26 Jan 2016 06:50:29 GMT
      Set-Cookie: 
      - TS018aacab=01c9ad79a09354287b1f08b62da33a59c3586f869f615d803e931cd442cf96ad62a24b1f5d; Path=/
      Pragma: 
      - no-cache
      Content-Length: 
      - "1403"
      Content-Type: 
      - application/json;charset=UTF-8
    body: 
      string: "{\"gatewayEntryPoint\":\"WEB_SERVICES_API\",\"merchant\":\"<TNS_MERCHANT_ID>\",\"order\":{\"amount\":100.00,\"creationTime\":\"2016-01-26T06:50:29.629Z\",\"currency\":\"EUR\",\"id\":\"10000001705\",\"reference\":\"PAY\",\"status\":\"CAPTURED\",\"totalAuthorizedAmount\":100.00,\"totalCapturedAmount\":100.00,\"totalRefundedAmount\":0.00},\"response\":{\"acquirerCode\":\"00\",\"acquirerMessage\":\"Approved\",\"gatewayCode\":\"APPROVED\"},\"result\":\"SUCCESS\",\"risk\":{\"response\":{\"gatewayCode\":\"ACCEPTED\",\"review\":{\"decision\":\"NOT_REQUIRED\"},\"rule\":[{\"data\":\"400555\",\"name\":\"MERCHANT_BIN_RANGE\",\"recommendation\":\"NO_ACTION\",\"type\":\"MERCHANT_RULE\"},{\"name\":\"SUSPECT_CARD_LIST\",\"recommendation\":\"NO_ACTION\",\"type\":\"MERCHANT_RULE\"},{\"name\":\"TRUSTED_CARD_LIST\",\"recommendation\":\"NO_ACTION\",\"type\":\"MERCHANT_RULE\"},{\"data\":\"400555\",\"name\":\"MSO_BIN_RANGE\",\"recommendation\":\"NO_ACTION\",\"type\":\"MSO_RULE\"}]}},\"sourceOfFunds\":{\"provided\":{\"card\":{\"brand\":\"VISA\",\"expiry\":{\"month\":\"5\",\"year\":\"17\"},\"fundingMethod\":\"CREDIT\",\"issuer\":\"JPMORGAN CHASE BANK, N.A.\",\"number\":\"400555xxxxxx0001\",\"scheme\":\"VISA\"}},\"token\":\"9117717323490920\",\"type\":\"CARD\"},\"timeOfRecord\":\"2016-01-26T06:50:29.629Z\",\"transaction\":{\"acquirer\":{\"batch\":1,\"id\":\"AIB\",\"merchantId\":\"011855511\"},\"amount\":100.00,\"authorizationCode\":\"029662\",\"currency\":\"EUR\",\"frequency\":\"SINGLE\",\"id\":\"PAY\",\"receipt\":\"AAAAC65HHF\",\"reference\":\"PAY\",\"source\":\"MOTO\",\"terminal\":\"31208585\",\"type\":\"PAYMENT\"},\"version\":\"30\"}"
    http_version: 
  recorded_at: Tue, 26 Jan 2016 06:50:30 GMT
